---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerTable.GetValues
source: html/2fa7d011-c5db-3863-af69-59b06d0a38a9.htm
---
# Autodesk.Revit.DB.ExportLayerTable.GetValues Method

Returns all the values stored in the map.

## Syntax (C#)
```csharp
public IList<ExportLayerInfo> GetValues()
```

## Returns
Return the info array.